In [66]:
import pandas as pd
import matplotlib.pyplot as plt
from statsmodels.graphics.tsaplots import plot_pacf, plot_acf, seasonal_plot, month_plot, quarter_plot
from statsmodels.tsa.holtwinters import ExponentialSmoothing
from statsmodels.tsa.seasonal import seasonal_decompose

# Load data and set index and frequenct

In [104]:
df= pd.read_csv(r"C:\Users\MINE\Desktop\time series analysis\Time Series Analysis\CAPSTONE PROJECT - Airmiles\airmiles.csv")

In [105]:
df.head()

       Date  airmiles
0  1/1/1996  30983174
1  1/2/1996  32147663
2  1/3/1996  38342975
3  1/4/1996  35969113
4  1/5/1996  36474391

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 113 entries, 0 to 112
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      113 non-null    object
 1   airmiles  113 non-null    int64
dtypes: int64(1), object(1)
memory usage: 1.9+ KB

In [ ]:
df.set_index('Date', inplace= True)

In [ ]:
df.index= pd.to_datetime(df.index, dayfirst= True)

# Remenber to put in year month day format

In [ ]:
df= df.asfreq("MS")

# Use ms to indicate month start

In [111]:
df.index

DatetimeIndex(['1996-01-01', '1996-02-01', '1996-03-01', '1996-04-01',
               '1996-05-01', '1996-06-01', '1996-07-01', '1996-08-01',
               '1996-09-01', '1996-10-01',
               ...
               '2004-08-01', '2004-09-01', '2004-10-01', '2004-11-01',
               '2004-12-01', '2005-01-01', '2005-02-01', '2005-03-01',
               '2005-04-01', '2005-05-01'],
              dtype='datetime64[ns]', name='Date', length=113, freq='MS')

In [112]:
df.head()

            airmiles
Date
1996-01-01  30983174
1996-02-01  32147663
1996-03-01  38342975
1996-04-01  35969113
1996-05-01  36474391

In [ ]:
#